jnnycn007/esp-iot-solution/examples/display/gui/gsp_lvgl_present_handoff/sdkconfig.defaults.esp32s3
# ESP32-S3 default configuration

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_EXAMPLE_LCD_INTERFACE_SPI_WITH_PSRAM=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
